saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.LPC54101_DFP.11.0.0.pdsc
    <condition id="device.LPC54101_AND_driver.common_AND_driver.power">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54101_AND_utility.debug_console">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.common">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54101_AND_component.lists_AND_utility.debug_console">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.vusart">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC54101">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.LPC54101_AND_component.serial_manager_AND_driver.common">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.lpc_dma_AND_driver.lpc_i2c">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.lpc_dma_AND_driver.vspi">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.lpc_dma_AND_driver.vusart">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.common_AND_driver.inputmux_connections">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.LPC54101_AND_device.LPC54101_CMSIS_AND_driver.clock_AND_driver.reset">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC54101_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
    </condition>
    <condition id="device.LPC54101_AND_component.serial_manager_uart_AND_component.vusart_adapter_AND_device.LPC54101_startup_AND_driver.clock_AND_driver.common_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.vusart_AND_utility.debug_console">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="vusart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC54101_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
    <condition id="device.LPC54101_AND_CMSIS_Include_core_cm4">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.LPC54101_AND_driver.common_AND_driver.power">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="device.LPC54101_AND_utility.debug_console">
      <description/>
      <files>
        <file category="sourceC" name="utilities/fsl_assert.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="device.LPC54101_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="utilities/fsl_notifier.c"/>
        <file category="header" name="utilities/fsl_notifier.h"/>
      </files>
    </component>
